Autodesk.Revit.DB.IFC.ExporterIFC.Set2DContextHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the IfcRepresentationContext handle to be used for 2D entities (Annotations).
contextHandle:
The IfcRepresentationContext.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.Get2DContextHandle
Obtains the IfcRepresentationContext handle to be used for 2D entities (Annotations).
Remarks:
The context handle is automatically applied with a 1:100 scale.
Returns:
The IfcRepresentationContext.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.ExportAs2x3
Identifies if the file version being exported is 2x3.
Remarks:
Returns true even for alternative formats equivalent to 2x3, such as COBIE.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.ExportAs2x2
Identifies if the file version being exported is 2x2.
Remarks:
Returns true even for alternative formats equivalent to 2x2, such as BCA.
Since:
2012